tag = '<a href="http://www.python.org">Python web site</a>'
#切取同一段内容
print(tag[9:30]) #正序切片
print(tag[9:-21]) #正负切片
print(tag[-42:-21]) #负切片

#省略前后索引，把一串字符串切成两半
print(tag[:-19])
print(tag[32:])

#示例
# url = input("请输入url地址：")
# domain = url[:5]
# print(domain)


#更大的步长
aaa = [1,2,3,4,5,6,7,8,9,10]
print(aaa[1:10:2]) #其中2代表步长
print(aaa[2:10:2]) #其中2代表步长
print(aaa[3:10:2]) #其中2代表步长
print(aaa[4:10:2]) #其中2代表步长
print(aaa[5:10:2]) #其中2代表步长
print("=========================================")
print(aaa[0:10:1]) #其中2代表步长
print(aaa[0:10:2]) #其中2代表步长
print(aaa[0:10:3]) #其中2代表步长
print(aaa[0:10:4]) #其中2代表步长
print(aaa[0:10:5]) #其中2代表步长
print("=========================================")
print(aaa[::5])
print(aaa[::-5])    #步长不能为0，否则无法向前移动，但可以为负数，即从右向左提取元素。

#===============================================执行结果=========================================
# C:\Users\guohui\testDemo\Scripts\python.exe D:/python文件存放/testDemo/06列表和元组/切片.py
# http://www.python.org
# http://www.python.org
# http://www.python.org
# <a href="http://www.python.org">
# Python web site</a>
# [2, 4, 6, 8, 10]
# [3, 5, 7, 9]
# [4, 6, 8, 10]
# [5, 7, 9]
# [6, 8, 10]
# =========================================
# [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# [1, 3, 5, 7, 9]
# [1, 4, 7, 10]
# [1, 5, 9]
# [1, 6]
# =========================================
# [1, 6]
# [10, 5]



