a  = [1, 2, 3, 45]
b = ['a','s','d','e']
c = [a,b]
import copy
c1 = copy.deepcopy(c)
c1[0].append(100)
print(c1,c)
print('*'*20)
c2 = copy.copy(c)
c2[0].append(100)
print(c2,c)
# [[1, 2, 3, 45, 100], ['a', 's', 'd', 'e']] [[1, 2, 3, 45], ['a', 's', 'd', 'e']]
# ********************
# [[1, 2, 3, 45, 100], ['a', 's', 'd', 'e']] [[1, 2, 3, 45, 100], ['a', 's', 'd', 'e']]

w = (1,2,3,4,a)         #元组中当某个元素为可变对象时，深拷贝开辟出一个新的内存空间，浅拷贝指向本身
d1=copy.deepcopy(w)     #当元组中元素全为不可变对象时，深浅拷贝都是指向它的本身
d2 = copy.copy(w)

print(id(w))            # 2617816417560
print(id(d1))           # 2617816417472
print(id(d2))           # 2617816417560


